package org.example;

import java.util.Arrays;
import java.util.List;

public class TextHelper {
    private static final String textSeparators = "\\s*[.!?]+\\s*";
    private static final String sentSeparators = "[,:; \\-—\"]+";

    private static String cleanText(String text) {
        return text.replaceAll("\n+", " ").replaceAll("\\s+", " ");
    }

    public static List<String> splitToSentences(String text, boolean isCleaned) {
        if (!isCleaned) {
            text = cleanText(text);
        }
        return Arrays.asList(text.split(textSeparators));
    }

    public static List<String> splitToWords(String sentence) {
        return Arrays.asList(sentence.split(sentSeparators));
    }

    public static List<String> filterStopWords(List<String> sentence) {
        return sentence.stream()
                .filter(word -> !STOP_WORDS.contains(word))
                .toList();
    }

    public static final List<String> STOP_WORDS = Arrays.asList(
            "було", "бути", "більш", "більше", "в", "важлива", "важливе", "важливий", "важливі",
            "вам", "вами", "вас", "ваш", "ваша", "ваше", "ваші", "вгору", "вдалині", "весь", "вже",
            "ви", "вміти", "вниз", "внизу", "вона", "вони", "воно", "восьмий", "все", "всею",
            "всього", "всьому", "всю", "вся", "всім", "всіх", "втім", "від", "відсотків", "він",
            "вісім", "вісімнадцятий", "вісімнадцять", "г", "геть", "говорив", "давно", "далеко",
            "далі", "даром", "два", "двадцятий", "двадцять", "дванадцятий", "дванадцять", "двох",
            "дві", "де", "дев'ятий", "дев'ятнадцятий", "дев'ятнадцять", "дев'ять", "день", "десятий",
            "десять", "для", "до", "добре", "довго", "досить", "другий", "друго", "дуже", "дякую",
            "дійсно", "е", "ж", "життя", "з", "за", "завжди", "зазвичай", "зайнята", "зайнятий",
            "зайнято", "зайняті", "занадто", "зараз", "зате", "звичайно", "звідси", "звідусіль",
            "здається", "значить", "знову", "зовсім", "зі", "його", "йому", "каже", "ким", "кого",
            "кожен", "кожна", "кожне", "кожні", "коли", "кому", "краще", "кругом", "крім", "куди",
            "кілька", "ледве", "лише", "люди", "людина", "м", "майже", "мало", "мати", "мене",
            "менше", "мені", "ми", "миру", "мною", "могти", "мож", "може", "можна", "можуть", "моя",
            "моє", "мої", "міг", "між", "мій", "мільйонів", "на", "навколо", "навіть", "навіщо",
            "нагорі", "над", "назад", "найбільш", "нам", "нами", "нарешті", "нас", "наш", "наша",
            "наше", "наші", "не", "не можна", "небудь", "недалеко", "немає", "нерідко", "нещодавно",
            "нею", "неї", "нижче", "низько", "ними", "них", "ну", "нього", "ні", "ніби", "ніж",
            "ній", "ніколи", "нікуди", "нічого", "обидва", "один", "одинадцятий", "одинадцять",
            "однак", "одного", "одного разу", "однієї", "особливо", "ось", "п'ятий", "п'ятнадцятий",
            "п'ятнадцять", "п'ять", "перед", "перший", "по", "повинно", "поки", "пора", "поруч",
            "посеред", "потрібно", "потім", "початку", "прекрасно", "при", "про", "просто", "проти",
            "під", "пізніше", "пір", "після", "раз", "рано", "раніше", "раптом", "року", "років",
            "році", "рік", "сам", "сама", "саме", "самим", "самими", "самих", "самого", "самому",
            "саму", "самі", "самій", "свого", "свою", "своє", "своєї", "свої", "своїх", "себе",
            "сих", "сказав", "сказала", "сказати", "скрізь", "скільки", "собою", "собі", "спасибі",
            "спочатку", "справ", "став", "суть", "сьогодні", "сьомий", "сім", "сімнадцятий",
            "сімнадцять", "т", "та", "так", "така", "таке", "такий", "також", "такі", "там", "твоя",
            "твоє", "твій", "тебе", "теж", "тепер", "ти", "тим", "тими", "тисяч", "тих", "то",
            "тобою", "тобі", "того", "тоді", "той", "тому", "тою", "треба", "третій", "три",
            "тринадцятий", "тринадцять", "трохи", "ту", "туди", "тут", "ті", "тільки", "у",
            "усюди", "усіма", "хотіти", "хоч", "хоча", "хочеш", "хто", "хіба", "це", "цей", "цим",
            "цими", "цих", "цього", "цьому", "цю", "ця", "ці", "цієї", "час", "часто", "частіше",
            "часу", "через", "четвертий", "чи", "численна", "численне", "численний", "численні",
            "чого", "чому", "чотири", "чотирнадцятий", "чотирнадцять", "чудово", "шостий",
            "шістнадцятий", "шістнадцять", "шість", "ще", "що", "щоб", "я", "як", "яка", "який",
            "яких", "якого", "якої", "якщо", "які", "є", "і", "ім'я", "іноді", "інша", "інше",
            "інший", "інших", "інші", "їй", "їм", "їх", "її"
    );
}
